Revit 2027 API
IFCData.CreateEnumeration Method
 Creates a enum data object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCData CreateEnumeration(
	string value
)
Public Shared Function CreateEnumeration (
	value As String
) As IFCData
public:
static IFCData^ CreateEnumeration(
	String^ value
)
static member CreateEnumeration :
        value : string -> IFCData
Parameters
value String
 The string value.
Return Value
IFCData
 The IFCData object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace